cases/MICP/dissolution/c=74e-2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

   

    left
    {
          type            fixedValue;
 value      uniform 1e-8;
     }

    right
    {
          type          zeroGradient;
      // value	       uniform 0;
    }

     bottom
    {
       type            cyclic;
    }
    top
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
